###############################################################
#  Generated by:      Cadence Innovus 20.14-s095_1
#  OS:                Linux x86_64(Host ID cad14)
#  Generated on:      Fri Oct 31 13:03:35 2025
#  Design:            cache_memory
#  Command:           routeDesign -globalDetail
###############################################################
current_design cache_memory
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_drive 1  [get_ports {clk}]
set_drive 1  [get_ports {rst}]
set_drive 1  [get_ports {addr[31]}]
set_drive 1  [get_ports {addr[30]}]
set_drive 1  [get_ports {addr[29]}]
set_drive 1  [get_ports {addr[28]}]
set_drive 1  [get_ports {addr[27]}]
set_drive 1  [get_ports {addr[26]}]
set_drive 1  [get_ports {addr[25]}]
set_drive 1  [get_ports {addr[24]}]
set_drive 1  [get_ports {addr[23]}]
set_drive 1  [get_ports {addr[22]}]
set_drive 1  [get_ports {addr[21]}]
set_drive 1  [get_ports {addr[20]}]
set_drive 1  [get_ports {addr[19]}]
set_drive 1  [get_ports {addr[18]}]
set_drive 1  [get_ports {addr[17]}]
set_drive 1  [get_ports {addr[16]}]
set_drive 1  [get_ports {addr[15]}]
set_drive 1  [get_ports {addr[14]}]
set_drive 1  [get_ports {addr[13]}]
set_drive 1  [get_ports {addr[12]}]
set_drive 1  [get_ports {addr[11]}]
set_drive 1  [get_ports {addr[10]}]
set_drive 1  [get_ports {addr[9]}]
set_drive 1  [get_ports {addr[8]}]
set_drive 1  [get_ports {addr[7]}]
set_drive 1  [get_ports {addr[6]}]
set_drive 1  [get_ports {addr[5]}]
set_drive 1  [get_ports {addr[4]}]
set_drive 1  [get_ports {addr[3]}]
set_drive 1  [get_ports {addr[2]}]
set_drive 1  [get_ports {addr[1]}]
set_drive 1  [get_ports {addr[0]}]
set_drive 1  [get_ports {write_data[31]}]
set_drive 1  [get_ports {write_data[30]}]
set_drive 1  [get_ports {write_data[29]}]
set_drive 1  [get_ports {write_data[28]}]
set_drive 1  [get_ports {write_data[27]}]
set_drive 1  [get_ports {write_data[26]}]
set_drive 1  [get_ports {write_data[25]}]
set_drive 1  [get_ports {write_data[24]}]
set_drive 1  [get_ports {write_data[23]}]
set_drive 1  [get_ports {write_data[22]}]
set_drive 1  [get_ports {write_data[21]}]
set_drive 1  [get_ports {write_data[20]}]
set_drive 1  [get_ports {write_data[19]}]
set_drive 1  [get_ports {write_data[18]}]
set_drive 1  [get_ports {write_data[17]}]
set_drive 1  [get_ports {write_data[16]}]
set_drive 1  [get_ports {write_data[15]}]
set_drive 1  [get_ports {write_data[14]}]
set_drive 1  [get_ports {write_data[13]}]
set_drive 1  [get_ports {write_data[12]}]
set_drive 1  [get_ports {write_data[11]}]
set_drive 1  [get_ports {write_data[10]}]
set_drive 1  [get_ports {write_data[9]}]
set_drive 1  [get_ports {write_data[8]}]
set_drive 1  [get_ports {write_data[7]}]
set_drive 1  [get_ports {write_data[6]}]
set_drive 1  [get_ports {write_data[5]}]
set_drive 1  [get_ports {write_data[4]}]
set_drive 1  [get_ports {write_data[3]}]
set_drive 1  [get_ports {write_data[2]}]
set_drive 1  [get_ports {write_data[1]}]
set_drive 1  [get_ports {write_data[0]}]
set_drive 1  [get_ports {mem_read}]
set_drive 1  [get_ports {mem_write}]
set_load -pin_load -max  0.05  [get_ports {read_data[31]}]
set_load -pin_load -min  0.05  [get_ports {read_data[31]}]
set_load -pin_load -max  0.05  [get_ports {read_data[30]}]
set_load -pin_load -min  0.05  [get_ports {read_data[30]}]
set_load -pin_load -max  0.05  [get_ports {read_data[29]}]
set_load -pin_load -min  0.05  [get_ports {read_data[29]}]
set_load -pin_load -max  0.05  [get_ports {read_data[28]}]
set_load -pin_load -min  0.05  [get_ports {read_data[28]}]
set_load -pin_load -max  0.05  [get_ports {read_data[27]}]
set_load -pin_load -min  0.05  [get_ports {read_data[27]}]
set_load -pin_load -max  0.05  [get_ports {read_data[26]}]
set_load -pin_load -min  0.05  [get_ports {read_data[26]}]
set_load -pin_load -max  0.05  [get_ports {read_data[25]}]
set_load -pin_load -min  0.05  [get_ports {read_data[25]}]
set_load -pin_load -max  0.05  [get_ports {read_data[24]}]
set_load -pin_load -min  0.05  [get_ports {read_data[24]}]
set_load -pin_load -max  0.05  [get_ports {read_data[23]}]
set_load -pin_load -min  0.05  [get_ports {read_data[23]}]
set_load -pin_load -max  0.05  [get_ports {read_data[22]}]
set_load -pin_load -min  0.05  [get_ports {read_data[22]}]
set_load -pin_load -max  0.05  [get_ports {read_data[21]}]
set_load -pin_load -min  0.05  [get_ports {read_data[21]}]
set_load -pin_load -max  0.05  [get_ports {read_data[20]}]
set_load -pin_load -min  0.05  [get_ports {read_data[20]}]
set_load -pin_load -max  0.05  [get_ports {read_data[19]}]
set_load -pin_load -min  0.05  [get_ports {read_data[19]}]
set_load -pin_load -max  0.05  [get_ports {read_data[18]}]
set_load -pin_load -min  0.05  [get_ports {read_data[18]}]
set_load -pin_load -max  0.05  [get_ports {read_data[17]}]
set_load -pin_load -min  0.05  [get_ports {read_data[17]}]
set_load -pin_load -max  0.05  [get_ports {read_data[16]}]
set_load -pin_load -min  0.05  [get_ports {read_data[16]}]
set_load -pin_load -max  0.05  [get_ports {read_data[15]}]
set_load -pin_load -min  0.05  [get_ports {read_data[15]}]
set_load -pin_load -max  0.05  [get_ports {read_data[14]}]
set_load -pin_load -min  0.05  [get_ports {read_data[14]}]
set_load -pin_load -max  0.05  [get_ports {read_data[13]}]
set_load -pin_load -min  0.05  [get_ports {read_data[13]}]
set_load -pin_load -max  0.05  [get_ports {read_data[12]}]
set_load -pin_load -min  0.05  [get_ports {read_data[12]}]
set_load -pin_load -max  0.05  [get_ports {read_data[11]}]
set_load -pin_load -min  0.05  [get_ports {read_data[11]}]
set_load -pin_load -max  0.05  [get_ports {read_data[10]}]
set_load -pin_load -min  0.05  [get_ports {read_data[10]}]
set_load -pin_load -max  0.05  [get_ports {read_data[9]}]
set_load -pin_load -min  0.05  [get_ports {read_data[9]}]
set_load -pin_load -max  0.05  [get_ports {read_data[8]}]
set_load -pin_load -min  0.05  [get_ports {read_data[8]}]
set_load -pin_load -max  0.05  [get_ports {read_data[7]}]
set_load -pin_load -min  0.05  [get_ports {read_data[7]}]
set_load -pin_load -max  0.05  [get_ports {read_data[6]}]
set_load -pin_load -min  0.05  [get_ports {read_data[6]}]
set_load -pin_load -max  0.05  [get_ports {read_data[5]}]
set_load -pin_load -min  0.05  [get_ports {read_data[5]}]
set_load -pin_load -max  0.05  [get_ports {read_data[4]}]
set_load -pin_load -min  0.05  [get_ports {read_data[4]}]
set_load -pin_load -max  0.05  [get_ports {read_data[3]}]
set_load -pin_load -min  0.05  [get_ports {read_data[3]}]
set_load -pin_load -max  0.05  [get_ports {read_data[2]}]
set_load -pin_load -min  0.05  [get_ports {read_data[2]}]
set_load -pin_load -max  0.05  [get_ports {read_data[1]}]
set_load -pin_load -min  0.05  [get_ports {read_data[1]}]
set_load -pin_load -max  0.05  [get_ports {read_data[0]}]
set_load -pin_load -min  0.05  [get_ports {read_data[0]}]
set_load -pin_load -max  0.05  [get_ports {hit}]
set_load -pin_load -min  0.05  [get_ports {hit}]
set_wire_load_mode enclosed
